In [5]:
import pandas as pd
from sqlalchemy import create_engine
# Example for MySQL database on localhost
# Replace 'your_username', 'your_password', 'your_database_name', and 'your_port' with your actual database credentials
database_url = "mysql+mysqlconnector://root:@localhost:3306/analystics_db"
engine = create_engine(database_url)
# Example query to fetch all data from a table
query = "SELECT * FROM employeesalary"
df = pd.read_sql(query, engine)
df

   EmployeeID            JobTitle  Salary
0        1001            Salesman   45000
1        1002        Receptionist   36000
2        1003            Salesman   63000
3        1004          Accountant   47000
4        1005                  HR   50000
5        1006    Regional Manager   65000
6        1007  Supplier Relations   41000
7        1008            Salesman   48000
8        1009          Accountant   42000

In [9]:
# df['Salary'] = df['Salary'].apply(lambda x: round(x, 2))
df.describe()

        EmployeeID        Salary
count     9.000000      9.000000
mean   1005.000000  48555.555556
std       2.738613   9709.674442
min    1001.000000  36000.000000
25%    1003.000000  42000.000000
50%    1005.000000  47000.000000
75%    1007.000000  50000.000000
max    1009.000000  65000.000000